# RebarSystemActiveBottomDir1Generic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemActiveBottomDir1Generic Property
ParameterTypeId Class See Also
---
"Bottom/Interior Major Direction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemActiveBottomDir1Generic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemActiveBottomDir1Generic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemActiveBottomDir1Generic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace